c5/src/Enums/AssignRoles/AssignRoles.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>AssignRoles</name>
  <enumValues>
    <name>Assign</name>
  </enumValues>
  <enumValues>
    <name>Cancel</name>
  </enumValues>
</mdclass:Enum>

c5/src/Documents/Roles/Roles.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Roles</name>
  <posting>Deny</posting>
  <attributes>
    <name>Action</name>
    <type>
      <types>EnumRef.AssignRoles</types>
    </type>
  </attributes>
  <attributes>
    <name>Company</name>
    <type>
      <types>CatalogRef.Companies</types>
    </type>
  </attributes>
  <attributes>
    <name>Creator</name>
    <type>
      <types>CatalogRef.Users</types>
    </type>
  </attributes>
  <attributes>
    <name>Department</name>
    <type>
      <types>CatalogRef.Departments</types>
    </type>
  </attributes>
  <attributes>
    <name>Memo</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Role</name>
    <type>
      <types>EnumRef.Roles</types>
    </type>
  </attributes>
  <attributes>
    <name>User</name>
    <type>
      <types>CatalogRef.Users</types>
    </type>
  </attributes>
</mdclass:Document>

c5/src/CommonModules/Responsibility/Module.bsl
Function Get ( Date, Company, Roles ) export
	
	SetPrivilegedMode ( true );
	list = Conversion.StringToArray ( Roles );
	table = getTable ( Date, Company, list );
	result = new Structure ();
	for each role in list do
		row = Table.Find ( Enums.Roles [ role ], "Role" );
		result.Insert ( role, ? ( row = undefined, undefined, row.Individual ) );
	enddo; 
	return result;
	
EndFunction 

Function getTable ( Date, Company, Roles )
	
	s = "
	|select Roles.Ref as Ref
	|into Documents
	|from Document.Roles as Roles
	|where not Roles.DeletionMark
	|and Roles.Action = value ( Enum.AssignRoles.Assign )
	|and Roles.Company = &Company
	|and Roles.Date <= &Date
	|and Roles.Role in ( &Roles )
	|;
	|select Roles.User.Employee.Individual as Individual, Roles.Role as Role
	|from Document.Roles as Roles
	|	//
	|	// Last changes
	|	//
	|	join (
	|		select Roles.Role as Role, max ( Roles.Date ) as Date
	|		from Document.Roles as Roles
	|		where Roles.Ref in ( select Ref from Documents )
	|		group by Roles.Role
	|	) as LastChanges
	|	on LastChanges.Role = Roles.Role
	|	and LastChanges.Date = Roles.Date
	|where Roles.Ref in ( select Ref from Documents )
	|";
	q = new Query ( s );
	q.SetParameter ( "Date", Date );
	q.SetParameter ( "Company", Company );
	list = new Array ();
	for each role in Roles do
		list.Add ( Enums.Roles [ role ] );
	enddo; 
	q.SetParameter ( "Roles", list );
	return q.Execute ().Unload ();
	
EndFunction
